Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_pwm.c
	/* Setup the signal to be passed upon occurrence of a FORCE_OUT signal */
	reg = base->DTSRCSEL;
	reg &= ~(0x3U << shift);
	reg |= (uint16_t)((uint16_t)mode << shift);
	base->DTSRCSEL = reg;
}

/*!
 * brief Enables the selected PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
void imxrt_pwm_enableinterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
	/* Upper 16 bits are for related to the submodule */
	base->SM[subModule].INTEN |= (mask & 0xFFFFU);
	/* Fault related interrupts */
	base->FCTRL |= ((mask >> 16U) & PWM_FCTRL_FIE_MASK);
}

/*!
 * brief Disables the selected PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
void imxrt_pwm_disableinterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
	base->SM[subModule].INTEN &= ~(mask & 0xFFFF);
	base->FCTRL &= ~((mask >> 16U) & PWM_FCTRL_FIE_MASK);
}

/*!
 * brief Gets the enabled PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 *
 * return The enabled interrupts. This is the logical OR of members of the
 *         enumeration ::pwm_interrupt_enable_t
 */
uint32_t imxrt_pwm_getenabledinterrupts(PWM_Type *base, pwm_submodule_t subModule)
{
	uint32_t enabledInterrupts;

	enabledInterrupts = base->SM[subModule].INTEN;
	enabledInterrupts |= ((uint32_t)(base->FCTRL & PWM_FCTRL_FIE_MASK) << 16U);
	return enabledInterrupts;
}

/*!
 * brief Gets the PWM status flags
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 *
 * return The status flags. This is the logical OR of members of the
 *         enumeration ::pwm_status_flags_t
 */
uint32_t imxrt_pwm_getstatusflags(PWM_Type *base, pwm_submodule_t subModule)
{
	uint32_t statusFlags;

	statusFlags = base->SM[subModule].STS;
	statusFlags |= ((uint32_t)(base->FSTS & PWM_FSTS_FFLAG_MASK) << 16U);

	return statusFlags;
}

/*!
 * brief Clears the PWM status flags
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The status flags to clear. This is a logical OR of members of the
 *                  enumeration ::pwm_status_flags_t
 */
void imxrt_pwm_clearstatusflags(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
	uint16_t reg;

	base->SM[subModule].STS = (mask & 0xFFFFU);
	reg = base->FSTS;
	/* Clear the fault flags and set only the ones we wish to clear as the fault flags are cleared
		* by writing a login one
		*/
	reg &= ~(PWM_FSTS_FFLAG_MASK);
	reg |= ((mask >> 16U) & PWM_FSTS_FFLAG_MASK);
	base->FSTS = reg;
}

/****************************************************************************
 * Name: imxrt_pwm_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   APB1 or 2 clocking for the GPIOs has already been configured by the RCC
 *   logic at power up.
 *
 ****************************************************************************/
static int imxrt_pwm_setup(FAR struct pwm_lowerhalf_s *dev)
{
	FAR struct imxrt_pwmtimer_s *priv = (FAR struct imxrt_pwmtimer_s *)dev;

	imxrt_pwm_setpwmldok(priv->base, kPWM_Control_Module_0 | kPWM_Control_Module_1 | kPWM_Control_Module_2, true);

	return OK;
}

/****************************************************************************
 * Name: imxrt_pwm_start
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/
static int imxrt_pwm_start(FAR struct pwm_lowerhalf_s *dev,
						 FAR const struct pwm_info_s *info)
{
	FAR struct imxrt_pwmtimer_s *priv = (FAR struct imxrt_pwmtimer_s *)dev;

	imxrt_pwm_starttimer(priv->base, kPWM_Control_Module_0 | kPWM_Control_Module_1 | kPWM_Control_Module_2);

	return OK;
}

/****************************************************************************
 * Name: imxrt_pwm_stop
 *
 * Description:
 *   Stop the pulsed output and reset the timer resources
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   This function is called to stop the pulsed output at anytime.  This
 *   method is also called from the timer interrupt handler when a repetition
 *   count expires... automatically stopping the timer.
 *
 ****************************************************************************/
static int imxrt_pwm_stop(FAR struct pwm_lowerhalf_s *dev)
{
	FAR struct imxrt_pwmtimer_s *priv = (FAR struct imxrt_pwmtimer_s *)dev;

	imxrt_pwm_stoptimer(priv->base, kPWM_Control_Module_0 | kPWM_Control_Module_1 | kPWM_Control_Module_2);

	return OK;
}

/****************************************************************************
 * Name: imxrt_pwm_shutdown
 *
 * Description:
 *   This method is called when the driver is closed.  The lower half driver
 *   stop pulsed output, free any resources, disable the timer hardware, and
 *   put the system into the lowest possible power usage state
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/
static int imxrt_pwm_shutdown(FAR struct pwm_lowerhalf_s *dev)
{
	FAR struct imxrt_pwmtimer_s *priv = (FAR struct imxrt_pwmtimer_s *)dev;

	/* Make sure that the output has been stopped */
	imxrt_pwm_stop(dev);

	/* Then put the GPIO pins back to the default state */
	imxrt_pwm_deinit(priv->base, kPWM_Control_Module_0 | kPWM_Control_Module_1 | kPWM_Control_Module_2);

	return OK;
}

/****************************************************************************
 * Name: imxrt_pwm_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/
static int imxrt_pwm_ioctl(FAR struct pwm_lowerhalf_s *dev, int cmd,
						 unsigned long arg)
{
	int ret = -ENOTTY;
	switch (cmd) {
	case PWMIOC_SETCHARACTERISTICS: {
		FAR const struct pwm_info_s *info = (FAR const struct pwm_info_s *)((uintptr_t)arg);
		DEBUGASSERT(info != NULL);
		//todo
	}
	break;
	case PWMIOC_IDLE:
		//todo
	break;
	default:
		//todo
	break;
	}

	return ret;
}

/****************************************************************************
 * Name: imxrt_pwm_reset
 *
 * Description:
 *   Reset pwm register value
 *
 * Input parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   timer - A number identifying the timer use. The number of valid timer
 *     IDs varies but is somewhere in the range of
 *     {0,...,5}.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/
static void imxrt_pwm_reset(FAR struct pwm_lowerhalf_s *dev, int timer)
{
	FAR struct imxrt_pwmtimer_s *priv = (FAR struct imxrt_pwmtimer_s *)dev;

