Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_pwm.c
	imxrt_pwm_stop(priv);
}

/****************************************************************************
 * Private Data
 ****************************************************************************/
static const struct pwm_ops_s g_pwm_ops = {
	.setup		= imxrt_pwm_setup,
	.shutdown	= imxrt_pwm_shutdown,
	.start		= imxrt_pwm_start,
	.stop		= imxrt_pwm_stop,
	.ioctl		= imxrt_pwm_ioctl,
};

#ifdef CONFIG_IMXRT_PWM1
static struct imxrt_pwmtimer_s g_pwm0_1 = {
	.ops	= &g_pwm_ops,
	.id		= 1,
	.base	= (PWM_Type *)PWM1_BASE,
};
#endif

#ifdef CONFIG_IMXRT_PWM2
static struct imxrt_pwmtimer_s g_pwm0_2 = {
	.ops	= &g_pwm_ops,
	.id		= 2,
	.base	= (PWM_Type *)PWM2_BASE,
};
#endif

#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
#ifdef CONFIG_IMXRT_PWM3
static struct imxrt_pwmtimer_s g_pwm0_3 = {
	.ops	= &g_pwm_ops,
	.id		= 3,
	.base	= (PWM_Type *)PWM3_BASE,
};
#endif

#ifdef CONFIG_IMXRT_PWM4
static struct imxrt_pwmtimer_s g_pwm0_4 = {
	.ops	= &g_pwm_ops,
	.id		= 4,
	.base	= (PWM_Type *)PWM4_BASE,
};
#endif
#endif

/************************************************************************************
 * Name: imxrt_pwm_pins_init
 *
 * Description:
 *   Initialize pin setting in pwm
 *
 ************************************************************************************/
static inline void imxrt_pwm_pins_init(void)
{
	imxrt_clock_enableclock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWMA00,   /* GPIO_SD_B0_00 is configured as FLEXPWM1_PWMA00 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWMB00,   /* GPIO_SD_B0_01 is configured as FLEXPWM1_PWMB00 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01,   /* GPIO_SD_B0_02 is configured as FLEXPWM1_PWMA01 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B0_04_FLEXPWM1_PWMA02,   /* GPIO_SD_B0_04 is configured as FLEXPWM1_PWMA02 */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWMA00,   /* GPIO_SD_B0_00 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
													Drive Strength Field: R0/6
													Speed Field: medium(100MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWMB00,   /* GPIO_SD_B0_01 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
													Drive Strength Field: R0/6
													Speed Field: medium(100MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01,   /* GPIO_SD_B0_02 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
													Drive Strength Field: R0/6
													Speed Field: medium(100MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B0_04_FLEXPWM1_PWMA02,   /* GPIO_SD_B0_04 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
													Drive Strength Field: R0/6
													Speed Field: medium(100MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
}

/************************************************************************************
 * Name: imxrt_pwm_clock_init
 *
 * Description:
 *   Initialize clock setting in flexspi
 *
 ************************************************************************************/
static inline void imxrt_pwm_clock_init(void)
{
	imxrt_clock_setdiv(kCLOCK_AhbDiv, 0x2); /* Set AHB PODF to 2, divide by 3 */
	imxrt_clock_setdiv(kCLOCK_IpgDiv, 0x3); /* Set IPG PODF to 3, divede by 4 */
}

static void imxrt_pwm_drv_init3phpwm(int numPWM)
{
	uint16_t deadTimeVal;
	pwm_signal_param_t pwmSignal[2];
	uint32_t pwmSourceClockInHz;
	uint32_t pwmFrequencyInHz = 1000;

	pwmSourceClockInHz = imxrt_clock_getfreq(kCLOCK_IpgClk);

	/* Set deadtime count, we set this to about 650ns */
	deadTimeVal = ((uint64_t)pwmSourceClockInHz * 650) / 1000000000;

	pwmSignal[0].pwmChannel = kPWM_PwmA;
	pwmSignal[0].level = kPWM_HighTrue;
	pwmSignal[0].dutyCyclePercent = 50; /* 1 percent dutycycle */
	pwmSignal[0].deadtimeValue = deadTimeVal;

	pwmSignal[1].pwmChannel = kPWM_PwmB;
	pwmSignal[1].level = kPWM_HighTrue;
	/* Dutycycle field of PWM B does not matter as we are running in PWM A complementary mode */
	pwmSignal[1].dutyCyclePercent = 50;
	pwmSignal[1].deadtimeValue = deadTimeVal;

	switch (numPWM) {
	case 0:
	/*********** PWMA_SM0 - phase A, configuration, setup 2 channel as an example ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM1_BASE, kPWM_Module_0, pwmSignal, 2, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM1 - phase B configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM1_BASE, kPWM_Module_1, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM2 - phase C configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM1_BASE, kPWM_Module_2, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);
	break;

	case 1:
	/*********** PWMA_SM0 - phase A, configuration, setup 2 channel as an example ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM2_BASE, kPWM_Module_0, pwmSignal, 2, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM1 - phase B configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM2_BASE, kPWM_Module_1, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM2 - phase C configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM2_BASE, kPWM_Module_2, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);
	break;

	#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	case 2:
	/*********** PWMA_SM0 - phase A, configuration, setup 2 channel as an example ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM3_BASE, kPWM_Module_0, pwmSignal, 2, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM1 - phase B configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM3_BASE, kPWM_Module_1, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM2 - phase C configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM3_BASE, kPWM_Module_2, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);
	break;

	case 3:
	/*********** PWMA_SM0 - phase A, configuration, setup 2 channel as an example ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM4_BASE, kPWM_Module_0, pwmSignal, 2, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM1 - phase B configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM4_BASE, kPWM_Module_1, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);

	/*********** PWMA_SM2 - phase C configuration, setup PWM A channel only ************/
	imxrt_pwm_setuppwm((PWM_Type *)PWM4_BASE, kPWM_Module_2, pwmSignal, 1, kPWM_SignedCenterAligned, pwmFrequencyInHz,
				pwmSourceClockInHz);
	break;
	#endif

	default:
	break;
	}
}


/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_pwminitialize
 *
 * Description:
 *   Initialize one timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use. The number of valid timer
 *     IDs varies but is somewhere in the range of
 *     {0,...,5}.
 *
 * Returned Value:
 *   On success, a pointer to the lower-half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 ****************************************************************************/
FAR struct pwm_lowerhalf_s *imxrt_pwminitialize(int timer)
{
	struct pwm_lowerhalf_s *lower = NULL;
	pwm_config_t pwmConfig;

