Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_pwm.c
	imxrt_pwm_pins_init();
	imxrt_pwm_clock_init();

	imxrt_pwm_getdefaultconfig(&pwmConfig);

#ifdef CONFIG_IMXRT_PWM1
	if (timer == 0) {
		/* Use full cycle reload */
		pwmConfig.reloadLogic = kPWM_ReloadPwmFullCycle;
		/* PWM A & PWM B form a complementary PWM pair */
		pwmConfig.pairOperation = kPWM_ComplementaryPwmA;
		pwmConfig.enableDebugMode = true;
		if (imxrt_pwm_init((PWM_Type *)PWM1_BASE, kPWM_Module_0, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		/* Initialize submodule 1 */
		pwmConfig.clockSource = kPWM_Submodule0Clock;
		pwmConfig.initializationControl = kPWM_Initialize_MasterSync;
		if (imxrt_pwm_init((PWM_Type *)PWM1_BASE, kPWM_Module_1, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		if (imxrt_pwm_init((PWM_Type *)PWM1_BASE, kPWM_Module_2, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		imxrt_pwm_drv_init3phpwm(timer);

		lower = (struct pwm_lowerhalf_s *)&g_pwm0_1;
	} else
#endif
#ifdef CONFIG_IMXRT_PWM2
	if (timer == 1) {
		/* Use full cycle reload */
		pwmConfig.reloadLogic = kPWM_ReloadPwmFullCycle;
		/* PWM A & PWM B form a complementary PWM pair */
		pwmConfig.pairOperation = kPWM_ComplementaryPwmA;
		pwmConfig.enableDebugMode = true;
		if (imxrt_pwm_init((PWM_Type *)PWM2_BASE, kPWM_Module_0, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		/* Initialize submodule 1 */
		pwmConfig.clockSource = kPWM_Submodule0Clock;
		pwmConfig.initializationControl = kPWM_Initialize_MasterSync;
		if (imxrt_pwm_init((PWM_Type *)PWM2_BASE, kPWM_Module_1, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		if (imxrt_pwm_init((PWM_Type *)PWM2_BASE, kPWM_Module_2, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		imxrt_pwm_drv_init3phpwm(timer);

		lower = (struct pwm_lowerhalf_s *)&g_pwm0_2;
	} else
#endif
#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
#ifdef CONFIG_IMXRT_PWM3
	if (timer == 2) {
		/* Use full cycle reload */
		pwmConfig.reloadLogic = kPWM_ReloadPwmFullCycle;
		/* PWM A & PWM B form a complementary PWM pair */
		pwmConfig.pairOperation = kPWM_ComplementaryPwmA;
		pwmConfig.enableDebugMode = true;
		if (imxrt_pwm_init((PWM_Type *)PWM3_BASE, kPWM_Module_0, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		/* Initialize submodule 1 */
		pwmConfig.clockSource = kPWM_Submodule0Clock;
		pwmConfig.initializationControl = kPWM_Initialize_MasterSync;
		if (imxrt_pwm_init((PWM_Type *)PWM3_BASE, kPWM_Module_1, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		if (imxrt_pwm_init((PWM_Type *)PWM3_BASE, kPWM_Module_2, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		imxrt_pwm_drv_init3phpwm(timer);

		lower = (struct pwm_lowerhalf_s *)&g_pwm0_3;
	} else
#endif
#ifdef CONFIG_IMXRT_PWM4
	if (timer == 3) {
		/* Use full cycle reload */
		pwmConfig.reloadLogic = kPWM_ReloadPwmFullCycle;
		/* PWM A & PWM B form a complementary PWM pair */
		pwmConfig.pairOperation = kPWM_ComplementaryPwmA;
		pwmConfig.enableDebugMode = true;
		if (imxrt_pwm_init((PWM_Type *)PWM4_BASE, kPWM_Module_0, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		/* Initialize submodule 1 */
		pwmConfig.clockSource = kPWM_Submodule0Clock;
		pwmConfig.initializationControl = kPWM_Initialize_MasterSync;
		if (imxrt_pwm_init((PWM_Type *)PWM4_BASE, kPWM_Module_1, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		if (imxrt_pwm_init((PWM_Type *)PWM4_BASE, kPWM_Module_2, &pwmConfig) == kStatus_Fail) {
			lldbg("PWM initialization failed\n");
			return NULL;
		}

		imxrt_pwm_drv_init3phpwm(timer);

		lower = (struct pwm_lowerhalf_s *)&g_pwm0_4;
	} else
#endif
#endif
	{
		lldbg("ERROR: invalid PWM is requested\n");
		return NULL;
	}

	imxrt_pwm_reset(lower, timer);

	return lower;
}
